# STLExportOptions Constructor (STLExportResolution) (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
STLExportOptions Constructor (STLExportResolution)
STLExportOptions Class See Also
---
Constructs a new instance of STLExportOptions with all predefined tessellation settings, depending on STL export resolution type. Note: in case of Custom resolution type, tessellation settings won't be predefined and will have default values.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2021.1
# Syntax
C#
---
```text
public STLExportOptions(
	STLExportResolution resolutionType
)
```

Visual Basic
---
```text
Public Sub New ( _
	resolutionType As STLExportResolution _
)
```

Visual C++
---
```text
public:
STLExportOptions(
	STLExportResolution resolutionType
)
```

# ### Parameters
resolutionType
    Type: Autodesk.Revit.DB..::..STLExportResolution The type of STL export resolution.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
STLExportOptions Class
STLExportOptions Overload
Autodesk.Revit.DB Namespace